balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA210.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24FJ128DA210" edc:procid="0x014C" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="10000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64" edc:rowerase="512"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits edc:extendeddataspace="PIC24FP">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Comp - Comparator" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="23"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2E - SPI2 Error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="33"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC6 - Input Capture 6" edc:irq="40"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="42"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="43"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="OC8 - Output Compare 8" edc:irq="44"/>
    <edc:Interrupt edc:cname="PMPInterrupt" edc:desc="PMP - Parallel Master Port" edc:irq="45"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="SI2C2 - I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="MI2C2 - I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC - Real-Time Clock and Calendar" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="U2E - UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC - Cyclic Redunancy Check" edc:irq="67"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Low Voltage Detect" edc:irq="72"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="U3ErrInterrupt" edc:desc="U3E - UART3 Error" edc:irq="81"/>
    <edc:Interrupt edc:cname="U3RXInterrupt" edc:desc="U3RX - UART3 Receiver" edc:irq="82"/>
    <edc:Interrupt edc:cname="U3TXInterrupt" edc:desc="U3TX - UART3 Transmitter" edc:irq="83"/>
    <edc:Interrupt edc:cname="SI2C3Interrupt" edc:desc="SI2C3 - I2C3 Slave Events" edc:irq="84"/>
    <edc:Interrupt edc:cname="MI2C3Interrupt" edc:desc="MI2C3 - I2C3 Master Events" edc:irq="85"/>
    <edc:Interrupt edc:cname="USB1Interrupt" edc:desc="USB1 - USB1 Interrupt" edc:irq="86"/>
    <edc:Interrupt edc:cname="U4ErrInterrupt" edc:desc="U4E - UART4 Error" edc:irq="87"/>
    <edc:Interrupt edc:cname="U4RXInterrupt" edc:desc="U4RX - UART4 Receiver" edc:irq="88"/>
    <edc:Interrupt edc:cname="U4TXInterrupt" edc:desc="U4TX - UART4 Transmitter" edc:irq="89"/>
    <edc:Interrupt edc:cname="SPI3ErrInterrupt" edc:desc="SPI3E - SPI3 Error" edc:irq="90"/>
    <edc:Interrupt edc:cname="SPI3Interrupt" edc:desc="SPI3 - SPI3 Transfer Done" edc:irq="91"/>
    <edc:Interrupt edc:cname="OC9Interrupt" edc:desc="OC9 - Output Compare 9" edc:irq="92"/>
    <edc:Interrupt edc:cname="IC9Interrupt" edc:desc="IC9 - Input Capture 9" edc:irq="93"/>
    <edc:Interrupt edc:cname="GFX1Interrupt" edc:desc="GFX1 - Graphics1 Interrupt" edc:irq="100"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x5" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x157f8" edc:regionid="program"/>
    <edc:WORMHoleSector edc:beginaddr="0x157f8" edc:endaddr="0x15800" edc:regionid="cfgmem">
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0xfc" edc:srcaddr="0x157fa" edc:srcmask="0x003f"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x60" edc:srcaddr="0x157fa" edc:srcmask="0x00c0"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x18" edc:srcaddr="0x157fa" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0xc0" edc:srcaddr="0x157fa" edc:srcmask="0x0c00"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x80" edc:srcaddr="0x157fa" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x04" edc:srcaddr="0x157fa" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x02" edc:srcaddr="0x157fa" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x01" edc:srcaddr="0x157fa" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x03" edc:srcaddr="0x157fc" edc:srcmask="0x0003"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x20" edc:srcaddr="0x157fc" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x04" edc:srcaddr="0x157fc" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0xc0" edc:srcaddr="0x157fc" edc:srcmask="0x00c0"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x07" edc:srcaddr="0x157fc" edc:srcmask="0x0700"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x08" edc:srcaddr="0x157fc" edc:srcmask="0x0800"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x70" edc:srcaddr="0x157fc" edc:srcmask="0x7000"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x80" edc:srcaddr="0x157fc" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x0f" edc:srcaddr="0x157fe" edc:srcmask="0x000f"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x10" edc:srcaddr="0x157fe" edc:srcmask="0x0010"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x10" edc:srcaddr="0x157fe" edc:srcmask="0x0020"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x40" edc:srcaddr="0x157fe" edc:srcmask="0x0040"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x80" edc:srcaddr="0x157fe" edc:srcmask="0x0080"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x03" edc:srcaddr="0x157fe" edc:srcmask="0x0300"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0x157fe" edc:srcmask="0x0800"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x01" edc:srcaddr="0x157fe" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x02" edc:srcaddr="0x157fe" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x40" edc:srcaddr="0x157fe" edc:srcmask="0x4000"/>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG4" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG4" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RES" edc:desc="Reserved" edc:ishidden="true" edc:mask="0xffff" edc:name="RES" edc:nzwidth="16">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xffff) == 0xffff"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
