balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA210.PIC
        <edc:SFRDef edc:access="--------nn------" edc:cname="ANSD" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------11------" edc:name="ANSD" edc:nzwidth="0x10" edc:por="--------11------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ANSD6" edc:desc="" edc:mask="0x1" edc:name="ANSD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD7" edc:desc="" edc:mask="0x1" edc:name="ANSD7" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------n---------" edc:cname="ANSE" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1---------" edc:name="ANSE" edc:nzwidth="0x10" edc:por="------1---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSE9" edc:desc="" edc:mask="0x1" edc:name="ANSE9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="ANSF" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------1" edc:name="ANSF" edc:nzwidth="0x10" edc:por="---------------1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSF0" edc:desc="" edc:mask="0x1" edc:name="ANSF0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnn------" edc:cname="ANSG" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1111------" edc:name="ANSG" edc:nzwidth="0x10" edc:por="------1111------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="274"/>
        <edc:SFRDef edc:access="n-nnn-nnnnnn-nnn" edc:cname="PMCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000-000000-000" edc:name="PMCON1" edc:nzwidth="0x10" edc:por="0-000-000000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQM" edc:desc="" edc:mask="0x3" edc:name="IRQM" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="BUSKEEP" edc:desc="" edc:mask="0x1" edc:name="BUSKEEP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ALMODE" edc:desc="" edc:mask="0x1" edc:name="ALMODE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ALP" edc:desc="" edc:mask="0x1" edc:name="ALP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSF" edc:desc="" edc:mask="0x3" edc:name="CSF" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX" edc:desc="" edc:mask="0x3" edc:name="ADRMUX" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSIDL" edc:desc="" edc:mask="0x1" edc:name="PSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMPEN" edc:desc="" edc:mask="0x1" edc:name="PMPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IRQM0" edc:desc="" edc:mask="0x1" edc:name="IRQM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQM1" edc:desc="" edc:mask="0x1" edc:name="IRQM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CSF0" edc:desc="" edc:mask="0x1" edc:name="CSF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSF1" edc:desc="" edc:mask="0x1" edc:name="CSF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX0" edc:desc="" edc:mask="0x1" edc:name="ADRMUX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRMUX1" edc:desc="" edc:mask="0x1" edc:name="ADRMUX1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="PARALLEL MASTER/SLAVE PORT" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="r-nnnnnnnnnnnnnn" edc:cname="PMCON2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="PMCON2" edc:nzwidth="0x10" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RADDR" edc:desc="" edc:mask="0xff" edc:name="RADDR" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="MSTSEL" edc:desc="" edc:mask="0x3" edc:name="MSTSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CURMST" edc:desc="" edc:mask="0x1" edc:name="CURMST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AMREQ" edc:desc="" edc:mask="0x1" edc:name="AMREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="" edc:mask="0x1" edc:name="TIMEOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RADDR16" edc:desc="" edc:mask="0x1" edc:name="RADDR16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR17" edc:desc="" edc:mask="0x1" edc:name="RADDR17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR18" edc:desc="" edc:mask="0x1" edc:name="RADDR18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR19" edc:desc="" edc:mask="0x1" edc:name="RADDR19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR20" edc:desc="" edc:mask="0x1" edc:name="RADDR20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR21" edc:desc="" edc:mask="0x1" edc:name="RADDR21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR22" edc:desc="" edc:mask="0x1" edc:name="RADDR22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RADDR23" edc:desc="" edc:mask="0x1" edc:name="RADDR23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSTSEL0" edc:desc="" edc:mask="0x1" edc:name="MSTSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MSTSEL1" edc:desc="" edc:mask="0x1" edc:name="MSTSEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn-nnnnnnn" edc:cname="PMCON3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000-0000000" edc:name="PMCON3" edc:nzwidth="0x10" edc:por="0000-000-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTEN16" edc:desc="" edc:mask="0x1" edc:name="PTEN16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN17" edc:desc="" edc:mask="0x1" edc:name="PTEN17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN18" edc:desc="" edc:mask="0x1" edc:name="PTEN18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN19" edc:desc="" edc:mask="0x1" edc:name="PTEN19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN20" edc:desc="" edc:mask="0x1" edc:name="PTEN20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN21" edc:desc="" edc:mask="0x1" edc:name="PTEN21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN22" edc:desc="" edc:mask="0x1" edc:name="PTEN22" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AWAITE" edc:desc="" edc:mask="0x1" edc:name="AWAITE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AWAITM" edc:desc="" edc:mask="0x3" edc:name="AWAITM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTBE0EN" edc:desc="" edc:mask="0x1" edc:name="PTBE0EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTBE1EN" edc:desc="" edc:mask="0x1" edc:name="PTBE1EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTRDEN" edc:desc="" edc:mask="0x1" edc:name="PTRDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTWREN" edc:desc="" edc:mask="0x1" edc:name="PTWREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="AWAITM0" edc:desc="" edc:mask="0x1" edc:name="AWAITM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AWAITM1" edc:desc="" edc:mask="0x1" edc:name="AWAITM1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMCON4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PMCON4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTEN0" edc:desc="" edc:mask="0x1" edc:name="PTEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN1" edc:desc="" edc:mask="0x1" edc:name="PTEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN2" edc:desc="" edc:mask="0x1" edc:name="PTEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN3" edc:desc="" edc:mask="0x1" edc:name="PTEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN4" edc:desc="" edc:mask="0x1" edc:name="PTEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN5" edc:desc="" edc:mask="0x1" edc:name="PTEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN6" edc:desc="" edc:mask="0x1" edc:name="PTEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN7" edc:desc="" edc:mask="0x1" edc:name="PTEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN8" edc:desc="" edc:mask="0x1" edc:name="PTEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN9" edc:desc="" edc:mask="0x1" edc:name="PTEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN10" edc:desc="" edc:mask="0x1" edc:name="PTEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN11" edc:desc="" edc:mask="0x1" edc:name="PTEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN12" edc:desc="" edc:mask="0x1" edc:name="PTEN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN13" edc:desc="" edc:mask="0x1" edc:name="PTEN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN14" edc:desc="" edc:mask="0x1" edc:name="PTEN14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTEN15" edc:desc="" edc:mask="0x1" edc:name="PTEN15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnnnnn-----" edc:cname="PMCS1CF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000000-----" edc:name="PMCS1CF" edc:nzwidth="16" edc:por="0000-000000-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ" edc:desc="" edc:mask="0x3" edc:name="PTSZ" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ACKP" edc:desc="" edc:mask="0x1" edc:name="ACKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SM" edc:desc="" edc:mask="0x1" edc:name="SM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDSP" edc:desc="" edc:mask="0x1" edc:name="RDSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRSP" edc:desc="" edc:mask="0x1" edc:name="WRSP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BEP" edc:desc="" edc:mask="0x1" edc:name="BEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSPTEN" edc:desc="" edc:mask="0x1" edc:name="CSPTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSP" edc:desc="" edc:mask="0x1" edc:name="CSP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSDIS" edc:desc="" edc:mask="0x1" edc:name="CSDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSZ0" edc:desc="" edc:mask="0x1" edc:name="PTSZ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTSZ1" edc:desc="" edc:mask="0x1" edc:name="PTSZ1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
