balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA210.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1HSYNC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1HSYNC" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HSST" edc:desc="" edc:mask="0xff" edc:name="HSST" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="HSLEN" edc:desc="" edc:mask="0xff" edc:name="HSLEN" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HSST0" edc:desc="" edc:mask="0x1" edc:name="HSST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST1" edc:desc="" edc:mask="0x1" edc:name="HSST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST2" edc:desc="" edc:mask="0x1" edc:name="HSST2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST3" edc:desc="" edc:mask="0x1" edc:name="HSST3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST4" edc:desc="" edc:mask="0x1" edc:name="HSST4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST5" edc:desc="" edc:mask="0x1" edc:name="HSST5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST6" edc:desc="" edc:mask="0x1" edc:name="HSST6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSST7" edc:desc="" edc:mask="0x1" edc:name="HSST7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN0" edc:desc="" edc:mask="0x1" edc:name="HSLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN1" edc:desc="" edc:mask="0x1" edc:name="HSLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN2" edc:desc="" edc:mask="0x1" edc:name="HSLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN3" edc:desc="" edc:mask="0x1" edc:name="HSLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN4" edc:desc="" edc:mask="0x1" edc:name="HSLEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN5" edc:desc="" edc:mask="0x1" edc:name="HSLEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN6" edc:desc="" edc:mask="0x1" edc:name="HSLEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HSLEN7" edc:desc="" edc:mask="0x1" edc:name="HSLEN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1VSYNC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1VSYNC" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VSST" edc:desc="" edc:mask="0xff" edc:name="VSST" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="VSLEN" edc:desc="" edc:mask="0xff" edc:name="VSLEN" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VSST0" edc:desc="" edc:mask="0x1" edc:name="VSST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST1" edc:desc="" edc:mask="0x1" edc:name="VSST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST2" edc:desc="" edc:mask="0x1" edc:name="VSST2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST3" edc:desc="" edc:mask="0x1" edc:name="VSST3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST4" edc:desc="" edc:mask="0x1" edc:name="VSST4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST5" edc:desc="" edc:mask="0x1" edc:name="VSST5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST6" edc:desc="" edc:mask="0x1" edc:name="VSST6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSST7" edc:desc="" edc:mask="0x1" edc:name="VSST7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN0" edc:desc="" edc:mask="0x1" edc:name="VSLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN1" edc:desc="" edc:mask="0x1" edc:name="VSLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN2" edc:desc="" edc:mask="0x1" edc:name="VSLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN3" edc:desc="" edc:mask="0x1" edc:name="VSLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN4" edc:desc="" edc:mask="0x1" edc:name="VSLEN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN5" edc:desc="" edc:mask="0x1" edc:name="VSLEN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN6" edc:desc="" edc:mask="0x1" edc:name="VSLEN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VSLEN7" edc:desc="" edc:mask="0x1" edc:name="VSLEN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1DBLCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1DBLCON" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HENST" edc:desc="" edc:mask="0xff" edc:name="HENST" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="VENST" edc:desc="" edc:mask="0xff" edc:name="VENST" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HENST0" edc:desc="" edc:mask="0x1" edc:name="HENST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST1" edc:desc="" edc:mask="0x1" edc:name="HENST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST2" edc:desc="" edc:mask="0x1" edc:name="HENST2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST3" edc:desc="" edc:mask="0x1" edc:name="HENST3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST4" edc:desc="" edc:mask="0x1" edc:name="HENST4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST5" edc:desc="" edc:mask="0x1" edc:name="HENST5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST6" edc:desc="" edc:mask="0x1" edc:name="HENST6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HENST7" edc:desc="" edc:mask="0x1" edc:name="HENST7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST0" edc:desc="" edc:mask="0x1" edc:name="VENST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST1" edc:desc="" edc:mask="0x1" edc:name="VENST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST2" edc:desc="" edc:mask="0x1" edc:name="VENST2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST3" edc:desc="" edc:mask="0x1" edc:name="VENST3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST4" edc:desc="" edc:mask="0x1" edc:name="VENST4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST5" edc:desc="" edc:mask="0x1" edc:name="VENST5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST6" edc:desc="" edc:mask="0x1" edc:name="VENST6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VENST7" edc:desc="" edc:mask="0x1" edc:name="VENST7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="G1CLUT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000000" edc:name="G1CLUT" edc:nzwidth="16" edc:por="00----0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLUTADR" edc:desc="" edc:mask="0xff" edc:name="CLUTADR" edc:nzwidth="8"/>
              <edc:SFRFieldDef edc:cname="CLUTRWEN" edc:desc="" edc:mask="0x1" edc:name="CLUTRWEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTTRD" edc:desc="" edc:mask="0x1" edc:name="CLUTTRD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CLUTBUSY" edc:desc="" edc:mask="0x1" edc:name="CLUTBUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTEN" edc:desc="" edc:mask="0x1" edc:name="CLUTEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLUTADR0" edc:desc="" edc:mask="0x1" edc:name="CLUTADR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR1" edc:desc="" edc:mask="0x1" edc:name="CLUTADR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR2" edc:desc="" edc:mask="0x1" edc:name="CLUTADR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR3" edc:desc="" edc:mask="0x1" edc:name="CLUTADR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR4" edc:desc="" edc:mask="0x1" edc:name="CLUTADR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR5" edc:desc="" edc:mask="0x1" edc:name="CLUTADR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR6" edc:desc="" edc:mask="0x1" edc:name="CLUTADR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTADR7" edc:desc="" edc:mask="0x1" edc:name="CLUTADR7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1CLUTWR" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1CLUTWR" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLUTWR" edc:desc="" edc:mask="0xffff" edc:name="CLUTWR" edc:nzwidth="16"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLUTWR0" edc:desc="" edc:mask="0x1" edc:name="CLUTWR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR1" edc:desc="" edc:mask="0x1" edc:name="CLUTWR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR2" edc:desc="" edc:mask="0x1" edc:name="CLUTWR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR3" edc:desc="" edc:mask="0x1" edc:name="CLUTWR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR4" edc:desc="" edc:mask="0x1" edc:name="CLUTWR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR5" edc:desc="" edc:mask="0x1" edc:name="CLUTWR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR6" edc:desc="" edc:mask="0x1" edc:name="CLUTWR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR7" edc:desc="" edc:mask="0x1" edc:name="CLUTWR7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR8" edc:desc="" edc:mask="0x1" edc:name="CLUTWR8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR9" edc:desc="" edc:mask="0x1" edc:name="CLUTWR9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR10" edc:desc="" edc:mask="0x1" edc:name="CLUTWR10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR11" edc:desc="" edc:mask="0x1" edc:name="CLUTWR11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR12" edc:desc="" edc:mask="0x1" edc:name="CLUTWR12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR13" edc:desc="" edc:mask="0x1" edc:name="CLUTWR13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR14" edc:desc="" edc:mask="0x1" edc:name="CLUTWR14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLUTWR15" edc:desc="" edc:mask="0x1" edc:name="CLUTWR15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
